MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4504-F100F512/mcu.h
/* ------------------------------  GPDMA0_CH_CFGH  ----------------------------- */
#define GPDMA0_CH_CFGH_FCMODE_Pos          (0UL)                     /*!< GPDMA0_CH0_1 CFGH: FCMODE (Bit 0)                           */
#define GPDMA0_CH_CFGH_FCMODE_Msk          (0x1UL)                   /*!< GPDMA0_CH0_1 CFGH: FCMODE (Bitfield-Mask: 0x01)             */
#define GPDMA0_CH_CFGH_FIFO_MODE_Pos       (1UL)                     /*!< GPDMA0_CH0_1 CFGH: FIFO_MODE (Bit 1)                        */
#define GPDMA0_CH_CFGH_FIFO_MODE_Msk       (0x2UL)                   /*!< GPDMA0_CH0_1 CFGH: FIFO_MODE (Bitfield-Mask: 0x01)          */
#define GPDMA0_CH_CFGH_PROTCTL_Pos         (2UL)                     /*!< GPDMA0_CH0_1 CFGH: PROTCTL (Bit 2)                          */
#define GPDMA0_CH_CFGH_PROTCTL_Msk         (0x1cUL)                  /*!< GPDMA0_CH0_1 CFGH: PROTCTL (Bitfield-Mask: 0x07)            */
#define GPDMA0_CH_CFGH_DS_UPD_EN_Pos       (5UL)                     /*!< GPDMA0_CH0_1 CFGH: DS_UPD_EN (Bit 5)                        */
#define GPDMA0_CH_CFGH_DS_UPD_EN_Msk       (0x20UL)                  /*!< GPDMA0_CH0_1 CFGH: DS_UPD_EN (Bitfield-Mask: 0x01)          */
#define GPDMA0_CH_CFGH_SS_UPD_EN_Pos       (6UL)                     /*!< GPDMA0_CH0_1 CFGH: SS_UPD_EN (Bit 6)                        */
#define GPDMA0_CH_CFGH_SS_UPD_EN_Msk       (0x40UL)                  /*!< GPDMA0_CH0_1 CFGH: SS_UPD_EN (Bitfield-Mask: 0x01)          */
#define GPDMA0_CH_CFGH_SRC_PER_Pos         (7UL)                     /*!< GPDMA0_CH0_1 CFGH: SRC_PER (Bit 7)                          */
#define GPDMA0_CH_CFGH_SRC_PER_Msk         (0x780UL)                 /*!< GPDMA0_CH0_1 CFGH: SRC_PER (Bitfield-Mask: 0x0f)            */
#define GPDMA0_CH_CFGH_DEST_PER_Pos        (11UL)                    /*!< GPDMA0_CH0_1 CFGH: DEST_PER (Bit 11)                        */
#define GPDMA0_CH_CFGH_DEST_PER_Msk        (0x7800UL)                /*!< GPDMA0_CH0_1 CFGH: DEST_PER (Bitfield-Mask: 0x0f)           */

/* ------------------------------  GPDMA0_CH_SGR  ------------------------------ */
#define GPDMA0_CH_SGR_SGI_Pos              (0UL)                     /*!< GPDMA0_CH0_1 SGR: SGI (Bit 0)                               */
#define GPDMA0_CH_SGR_SGI_Msk              (0xfffffUL)               /*!< GPDMA0_CH0_1 SGR: SGI (Bitfield-Mask: 0xfffff)              */
#define GPDMA0_CH_SGR_SGC_Pos              (20UL)                    /*!< GPDMA0_CH0_1 SGR: SGC (Bit 20)                              */
#define GPDMA0_CH_SGR_SGC_Msk              (0xfff00000UL)            /*!< GPDMA0_CH0_1 SGR: SGC (Bitfield-Mask: 0xfff)                */

/* ------------------------------  GPDMA0_CH_DSR  ------------------------------ */
#define GPDMA0_CH_DSR_DSI_Pos              (0UL)                     /*!< GPDMA0_CH0_1 DSR: DSI (Bit 0)                               */
#define GPDMA0_CH_DSR_DSI_Msk              (0xfffffUL)               /*!< GPDMA0_CH0_1 DSR: DSI (Bitfield-Mask: 0xfffff)              */
#define GPDMA0_CH_DSR_DSC_Pos              (20UL)                    /*!< GPDMA0_CH0_1 DSR: DSC (Bit 20)                              */
#define GPDMA0_CH_DSR_DSC_Msk              (0xfff00000UL)            /*!< GPDMA0_CH0_1 DSR: DSC (Bitfield-Mask: 0xfff)                */


/* ================================================================================ */
/* ================         struct 'GPDMA1' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  GPDMA1_RAWTFR  ------------------------------- */
#define GPDMA1_RAWTFR_CH0_Pos                 (0UL)                     /*!< GPDMA1 RAWTFR: CH0 (Bit 0)                                  */
#define GPDMA1_RAWTFR_CH0_Msk                 (0x1UL)                   /*!< GPDMA1 RAWTFR: CH0 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWTFR_CH1_Pos                 (1UL)                     /*!< GPDMA1 RAWTFR: CH1 (Bit 1)                                  */
#define GPDMA1_RAWTFR_CH1_Msk                 (0x2UL)                   /*!< GPDMA1 RAWTFR: CH1 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWTFR_CH2_Pos                 (2UL)                     /*!< GPDMA1 RAWTFR: CH2 (Bit 2)                                  */
#define GPDMA1_RAWTFR_CH2_Msk                 (0x4UL)                   /*!< GPDMA1 RAWTFR: CH2 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWTFR_CH3_Pos                 (3UL)                     /*!< GPDMA1 RAWTFR: CH3 (Bit 3)                                  */
#define GPDMA1_RAWTFR_CH3_Msk                 (0x8UL)                   /*!< GPDMA1 RAWTFR: CH3 (Bitfield-Mask: 0x01)                    */

/* -------------------------------  GPDMA1_RAWBLOCK  ------------------------------ */
#define GPDMA1_RAWBLOCK_CH0_Pos               (0UL)                     /*!< GPDMA1 RAWBLOCK: CH0 (Bit 0)                                */
#define GPDMA1_RAWBLOCK_CH0_Msk               (0x1UL)                   /*!< GPDMA1 RAWBLOCK: CH0 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_RAWBLOCK_CH1_Pos               (1UL)                     /*!< GPDMA1 RAWBLOCK: CH1 (Bit 1)                                */
#define GPDMA1_RAWBLOCK_CH1_Msk               (0x2UL)                   /*!< GPDMA1 RAWBLOCK: CH1 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_RAWBLOCK_CH2_Pos               (2UL)                     /*!< GPDMA1 RAWBLOCK: CH2 (Bit 2)                                */
#define GPDMA1_RAWBLOCK_CH2_Msk               (0x4UL)                   /*!< GPDMA1 RAWBLOCK: CH2 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_RAWBLOCK_CH3_Pos               (3UL)                     /*!< GPDMA1 RAWBLOCK: CH3 (Bit 3)                                */
#define GPDMA1_RAWBLOCK_CH3_Msk               (0x8UL)                   /*!< GPDMA1 RAWBLOCK: CH3 (Bitfield-Mask: 0x01)                  */

/* ------------------------------  GPDMA1_RAWSRCTRAN  ----------------------------- */
#define GPDMA1_RAWSRCTRAN_CH0_Pos             (0UL)                     /*!< GPDMA1 RAWSRCTRAN: CH0 (Bit 0)                              */
#define GPDMA1_RAWSRCTRAN_CH0_Msk             (0x1UL)                   /*!< GPDMA1 RAWSRCTRAN: CH0 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWSRCTRAN_CH1_Pos             (1UL)                     /*!< GPDMA1 RAWSRCTRAN: CH1 (Bit 1)                              */
#define GPDMA1_RAWSRCTRAN_CH1_Msk             (0x2UL)                   /*!< GPDMA1 RAWSRCTRAN: CH1 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWSRCTRAN_CH2_Pos             (2UL)                     /*!< GPDMA1 RAWSRCTRAN: CH2 (Bit 2)                              */
#define GPDMA1_RAWSRCTRAN_CH2_Msk             (0x4UL)                   /*!< GPDMA1 RAWSRCTRAN: CH2 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWSRCTRAN_CH3_Pos             (3UL)                     /*!< GPDMA1 RAWSRCTRAN: CH3 (Bit 3)                              */
#define GPDMA1_RAWSRCTRAN_CH3_Msk             (0x8UL)                   /*!< GPDMA1 RAWSRCTRAN: CH3 (Bitfield-Mask: 0x01)                */

