MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4504-F100F512/mcu.h
/* ------------------------------  GPDMA1_REQDSTREG  ------------------------------ */
#define GPDMA1_REQDSTREG_CH0_Pos              (0UL)                     /*!< GPDMA1 REQDSTREG: CH0 (Bit 0)                               */
#define GPDMA1_REQDSTREG_CH0_Msk              (0x1UL)                   /*!< GPDMA1 REQDSTREG: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQDSTREG_CH1_Pos              (1UL)                     /*!< GPDMA1 REQDSTREG: CH1 (Bit 1)                               */
#define GPDMA1_REQDSTREG_CH1_Msk              (0x2UL)                   /*!< GPDMA1 REQDSTREG: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQDSTREG_CH2_Pos              (2UL)                     /*!< GPDMA1 REQDSTREG: CH2 (Bit 2)                               */
#define GPDMA1_REQDSTREG_CH2_Msk              (0x4UL)                   /*!< GPDMA1 REQDSTREG: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQDSTREG_CH3_Pos              (3UL)                     /*!< GPDMA1 REQDSTREG: CH3 (Bit 3)                               */
#define GPDMA1_REQDSTREG_CH3_Msk              (0x8UL)                   /*!< GPDMA1 REQDSTREG: CH3 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQDSTREG_WE_CH0_Pos           (8UL)                     /*!< GPDMA1 REQDSTREG: WE_CH0 (Bit 8)                            */
#define GPDMA1_REQDSTREG_WE_CH0_Msk           (0x100UL)                 /*!< GPDMA1 REQDSTREG: WE_CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQDSTREG_WE_CH1_Pos           (9UL)                     /*!< GPDMA1 REQDSTREG: WE_CH1 (Bit 9)                            */
#define GPDMA1_REQDSTREG_WE_CH1_Msk           (0x200UL)                 /*!< GPDMA1 REQDSTREG: WE_CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQDSTREG_WE_CH2_Pos           (10UL)                    /*!< GPDMA1 REQDSTREG: WE_CH2 (Bit 10)                           */
#define GPDMA1_REQDSTREG_WE_CH2_Msk           (0x400UL)                 /*!< GPDMA1 REQDSTREG: WE_CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQDSTREG_WE_CH3_Pos           (11UL)                    /*!< GPDMA1 REQDSTREG: WE_CH3 (Bit 11)                           */
#define GPDMA1_REQDSTREG_WE_CH3_Msk           (0x800UL)                 /*!< GPDMA1 REQDSTREG: WE_CH3 (Bitfield-Mask: 0x01)              */

/* -----------------------------  GPDMA1_SGLREQSRCREG  ---------------------------- */
#define GPDMA1_SGLREQSRCREG_CH0_Pos           (0UL)                     /*!< GPDMA1 SGLREQSRCREG: CH0 (Bit 0)                            */
#define GPDMA1_SGLREQSRCREG_CH0_Msk           (0x1UL)                   /*!< GPDMA1 SGLREQSRCREG: CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQSRCREG_CH1_Pos           (1UL)                     /*!< GPDMA1 SGLREQSRCREG: CH1 (Bit 1)                            */
#define GPDMA1_SGLREQSRCREG_CH1_Msk           (0x2UL)                   /*!< GPDMA1 SGLREQSRCREG: CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQSRCREG_CH2_Pos           (2UL)                     /*!< GPDMA1 SGLREQSRCREG: CH2 (Bit 2)                            */
#define GPDMA1_SGLREQSRCREG_CH2_Msk           (0x4UL)                   /*!< GPDMA1 SGLREQSRCREG: CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQSRCREG_CH3_Pos           (3UL)                     /*!< GPDMA1 SGLREQSRCREG: CH3 (Bit 3)                            */
#define GPDMA1_SGLREQSRCREG_CH3_Msk           (0x8UL)                   /*!< GPDMA1 SGLREQSRCREG: CH3 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQSRCREG_WE_CH0_Pos        (8UL)                     /*!< GPDMA1 SGLREQSRCREG: WE_CH0 (Bit 8)                         */
#define GPDMA1_SGLREQSRCREG_WE_CH0_Msk        (0x100UL)                 /*!< GPDMA1 SGLREQSRCREG: WE_CH0 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQSRCREG_WE_CH1_Pos        (9UL)                     /*!< GPDMA1 SGLREQSRCREG: WE_CH1 (Bit 9)                         */
#define GPDMA1_SGLREQSRCREG_WE_CH1_Msk        (0x200UL)                 /*!< GPDMA1 SGLREQSRCREG: WE_CH1 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQSRCREG_WE_CH2_Pos        (10UL)                    /*!< GPDMA1 SGLREQSRCREG: WE_CH2 (Bit 10)                        */
#define GPDMA1_SGLREQSRCREG_WE_CH2_Msk        (0x400UL)                 /*!< GPDMA1 SGLREQSRCREG: WE_CH2 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQSRCREG_WE_CH3_Pos        (11UL)                    /*!< GPDMA1 SGLREQSRCREG: WE_CH3 (Bit 11)                        */
#define GPDMA1_SGLREQSRCREG_WE_CH3_Msk        (0x800UL)                 /*!< GPDMA1 SGLREQSRCREG: WE_CH3 (Bitfield-Mask: 0x01)           */

/* -----------------------------  GPDMA1_SGLREQDSTREG  ---------------------------- */
#define GPDMA1_SGLREQDSTREG_CH0_Pos           (0UL)                     /*!< GPDMA1 SGLREQDSTREG: CH0 (Bit 0)                            */
#define GPDMA1_SGLREQDSTREG_CH0_Msk           (0x1UL)                   /*!< GPDMA1 SGLREQDSTREG: CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQDSTREG_CH1_Pos           (1UL)                     /*!< GPDMA1 SGLREQDSTREG: CH1 (Bit 1)                            */
#define GPDMA1_SGLREQDSTREG_CH1_Msk           (0x2UL)                   /*!< GPDMA1 SGLREQDSTREG: CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQDSTREG_CH2_Pos           (2UL)                     /*!< GPDMA1 SGLREQDSTREG: CH2 (Bit 2)                            */
#define GPDMA1_SGLREQDSTREG_CH2_Msk           (0x4UL)                   /*!< GPDMA1 SGLREQDSTREG: CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQDSTREG_CH3_Pos           (3UL)                     /*!< GPDMA1 SGLREQDSTREG: CH3 (Bit 3)                            */
#define GPDMA1_SGLREQDSTREG_CH3_Msk           (0x8UL)                   /*!< GPDMA1 SGLREQDSTREG: CH3 (Bitfield-Mask: 0x01)              */
#define GPDMA1_SGLREQDSTREG_WE_CH0_Pos        (8UL)                     /*!< GPDMA1 SGLREQDSTREG: WE_CH0 (Bit 8)                         */
#define GPDMA1_SGLREQDSTREG_WE_CH0_Msk        (0x100UL)                 /*!< GPDMA1 SGLREQDSTREG: WE_CH0 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQDSTREG_WE_CH1_Pos        (9UL)                     /*!< GPDMA1 SGLREQDSTREG: WE_CH1 (Bit 9)                         */
#define GPDMA1_SGLREQDSTREG_WE_CH1_Msk        (0x200UL)                 /*!< GPDMA1 SGLREQDSTREG: WE_CH1 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQDSTREG_WE_CH2_Pos        (10UL)                    /*!< GPDMA1 SGLREQDSTREG: WE_CH2 (Bit 10)                        */
#define GPDMA1_SGLREQDSTREG_WE_CH2_Msk        (0x400UL)                 /*!< GPDMA1 SGLREQDSTREG: WE_CH2 (Bitfield-Mask: 0x01)           */
#define GPDMA1_SGLREQDSTREG_WE_CH3_Pos        (11UL)                    /*!< GPDMA1 SGLREQDSTREG: WE_CH3 (Bit 11)                        */
#define GPDMA1_SGLREQDSTREG_WE_CH3_Msk        (0x800UL)                 /*!< GPDMA1 SGLREQDSTREG: WE_CH3 (Bitfield-Mask: 0x01)           */

/* ------------------------------  GPDMA1_LSTSRCREG  ------------------------------ */
#define GPDMA1_LSTSRCREG_CH0_Pos              (0UL)                     /*!< GPDMA1 LSTSRCREG: CH0 (Bit 0)                               */
#define GPDMA1_LSTSRCREG_CH0_Msk              (0x1UL)                   /*!< GPDMA1 LSTSRCREG: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTSRCREG_CH1_Pos              (1UL)                     /*!< GPDMA1 LSTSRCREG: CH1 (Bit 1)                               */
#define GPDMA1_LSTSRCREG_CH1_Msk              (0x2UL)                   /*!< GPDMA1 LSTSRCREG: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTSRCREG_CH2_Pos              (2UL)                     /*!< GPDMA1 LSTSRCREG: CH2 (Bit 2)                               */
#define GPDMA1_LSTSRCREG_CH2_Msk              (0x4UL)                   /*!< GPDMA1 LSTSRCREG: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTSRCREG_CH3_Pos              (3UL)                     /*!< GPDMA1 LSTSRCREG: CH3 (Bit 3)                               */
#define GPDMA1_LSTSRCREG_CH3_Msk              (0x8UL)                   /*!< GPDMA1 LSTSRCREG: CH3 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTSRCREG_WE_CH0_Pos           (8UL)                     /*!< GPDMA1 LSTSRCREG: WE_CH0 (Bit 8)                            */
#define GPDMA1_LSTSRCREG_WE_CH0_Msk           (0x100UL)                 /*!< GPDMA1 LSTSRCREG: WE_CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTSRCREG_WE_CH1_Pos           (9UL)                     /*!< GPDMA1 LSTSRCREG: WE_CH1 (Bit 9)                            */
#define GPDMA1_LSTSRCREG_WE_CH1_Msk           (0x200UL)                 /*!< GPDMA1 LSTSRCREG: WE_CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTSRCREG_WE_CH2_Pos           (10UL)                    /*!< GPDMA1 LSTSRCREG: WE_CH2 (Bit 10)                           */
#define GPDMA1_LSTSRCREG_WE_CH2_Msk           (0x400UL)                 /*!< GPDMA1 LSTSRCREG: WE_CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTSRCREG_WE_CH3_Pos           (11UL)                    /*!< GPDMA1 LSTSRCREG: WE_CH3 (Bit 11)                           */
#define GPDMA1_LSTSRCREG_WE_CH3_Msk           (0x800UL)                 /*!< GPDMA1 LSTSRCREG: WE_CH3 (Bitfield-Mask: 0x01)              */

/* ------------------------------  GPDMA1_LSTDSTREG  ------------------------------ */
#define GPDMA1_LSTDSTREG_CH0_Pos              (0UL)                     /*!< GPDMA1 LSTDSTREG: CH0 (Bit 0)                               */
#define GPDMA1_LSTDSTREG_CH0_Msk              (0x1UL)                   /*!< GPDMA1 LSTDSTREG: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTDSTREG_CH1_Pos              (1UL)                     /*!< GPDMA1 LSTDSTREG: CH1 (Bit 1)                               */
#define GPDMA1_LSTDSTREG_CH1_Msk              (0x2UL)                   /*!< GPDMA1 LSTDSTREG: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTDSTREG_CH2_Pos              (2UL)                     /*!< GPDMA1 LSTDSTREG: CH2 (Bit 2)                               */
#define GPDMA1_LSTDSTREG_CH2_Msk              (0x4UL)                   /*!< GPDMA1 LSTDSTREG: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTDSTREG_CH3_Pos              (3UL)                     /*!< GPDMA1 LSTDSTREG: CH3 (Bit 3)                               */
#define GPDMA1_LSTDSTREG_CH3_Msk              (0x8UL)                   /*!< GPDMA1 LSTDSTREG: CH3 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_LSTDSTREG_WE_CH0_Pos           (8UL)                     /*!< GPDMA1 LSTDSTREG: WE_CH0 (Bit 8)                            */
#define GPDMA1_LSTDSTREG_WE_CH0_Msk           (0x100UL)                 /*!< GPDMA1 LSTDSTREG: WE_CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTDSTREG_WE_CH1_Pos           (9UL)                     /*!< GPDMA1 LSTDSTREG: WE_CH1 (Bit 9)                            */
#define GPDMA1_LSTDSTREG_WE_CH1_Msk           (0x200UL)                 /*!< GPDMA1 LSTDSTREG: WE_CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTDSTREG_WE_CH2_Pos           (10UL)                    /*!< GPDMA1 LSTDSTREG: WE_CH2 (Bit 10)                           */
#define GPDMA1_LSTDSTREG_WE_CH2_Msk           (0x400UL)                 /*!< GPDMA1 LSTDSTREG: WE_CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_LSTDSTREG_WE_CH3_Pos           (11UL)                    /*!< GPDMA1 LSTDSTREG: WE_CH3 (Bit 11)                           */
#define GPDMA1_LSTDSTREG_WE_CH3_Msk           (0x800UL)                 /*!< GPDMA1 LSTDSTREG: WE_CH3 (Bitfield-Mask: 0x01)              */

/* ------------------------------  GPDMA1_DMACFGREG  ------------------------------ */
#define GPDMA1_DMACFGREG_DMA_EN_Pos           (0UL)                     /*!< GPDMA1 DMACFGREG: DMA_EN (Bit 0)                            */
#define GPDMA1_DMACFGREG_DMA_EN_Msk           (0x1UL)                   /*!< GPDMA1 DMACFGREG: DMA_EN (Bitfield-Mask: 0x01)              */

/* -------------------------------  GPDMA1_CHENREG  ------------------------------- */
#define GPDMA1_CHENREG_CH_Pos                 (0UL)                     /*!< GPDMA1 CHENREG: CH (Bit 0)                                  */
#define GPDMA1_CHENREG_CH_Msk                 (0xfUL)                   /*!< GPDMA1 CHENREG: CH (Bitfield-Mask: 0x0f)                    */
#define GPDMA1_CHENREG_WE_CH_Pos              (8UL)                     /*!< GPDMA1 CHENREG: WE_CH (Bit 8)                               */
#define GPDMA1_CHENREG_WE_CH_Msk              (0xf00UL)                 /*!< GPDMA1 CHENREG: WE_CH (Bitfield-Mask: 0x0f)                 */

