MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4504-F100F512/mcu.h
/* ------------------------------  SDMMC_WAKEUP_CTRL  ----------------------------- */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INT_Pos (0UL)                 /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INT (Bit 0)              */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INT_Msk (0x1UL)               /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INT (Bitfield-Mask: 0x01) */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INS_Pos (1UL)                 /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INS (Bit 1)              */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_INS_Msk (0x2UL)               /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_INS (Bitfield-Mask: 0x01) */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_REM_Pos (2UL)                 /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_REM (Bit 2)              */
#define SDMMC_WAKEUP_CTRL_WAKEUP_EVENT_EN_REM_Msk (0x4UL)               /*!< SDMMC WAKEUP_CTRL: WAKEUP_EVENT_EN_REM (Bitfield-Mask: 0x01) */

/* ------------------------------  SDMMC_CLOCK_CTRL  ------------------------------ */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_EN_Pos (0UL)                    /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_EN (Bit 0)                 */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_EN_Msk (0x1UL)                  /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_EN (Bitfield-Mask: 0x01)   */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_STABLE_Pos (1UL)                /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_STABLE (Bit 1)             */
#define SDMMC_CLOCK_CTRL_INTERNAL_CLOCK_STABLE_Msk (0x2UL)              /*!< SDMMC CLOCK_CTRL: INTERNAL_CLOCK_STABLE (Bitfield-Mask: 0x01) */
#define SDMMC_CLOCK_CTRL_SDCLOCK_EN_Pos       (2UL)                     /*!< SDMMC CLOCK_CTRL: SDCLOCK_EN (Bit 2)                        */
#define SDMMC_CLOCK_CTRL_SDCLOCK_EN_Msk       (0x4UL)                   /*!< SDMMC CLOCK_CTRL: SDCLOCK_EN (Bitfield-Mask: 0x01)          */
#define SDMMC_CLOCK_CTRL_SDCLK_FREQ_SEL_Pos   (8UL)                     /*!< SDMMC CLOCK_CTRL: SDCLK_FREQ_SEL (Bit 8)                    */
#define SDMMC_CLOCK_CTRL_SDCLK_FREQ_SEL_Msk   (0xff00UL)                /*!< SDMMC CLOCK_CTRL: SDCLK_FREQ_SEL (Bitfield-Mask: 0xff)      */

/* -----------------------------  SDMMC_TIMEOUT_CTRL  ----------------------------- */
#define SDMMC_TIMEOUT_CTRL_DAT_TIMEOUT_CNT_VAL_Pos (0UL)                /*!< SDMMC TIMEOUT_CTRL: DAT_TIMEOUT_CNT_VAL (Bit 0)             */
#define SDMMC_TIMEOUT_CTRL_DAT_TIMEOUT_CNT_VAL_Msk (0xfUL)              /*!< SDMMC TIMEOUT_CTRL: DAT_TIMEOUT_CNT_VAL (Bitfield-Mask: 0x0f) */

/* -------------------------------  SDMMC_SW_RESET  ------------------------------- */
#define SDMMC_SW_RESET_SW_RST_ALL_Pos         (0UL)                     /*!< SDMMC SW_RESET: SW_RST_ALL (Bit 0)                          */
#define SDMMC_SW_RESET_SW_RST_ALL_Msk         (0x1UL)                   /*!< SDMMC SW_RESET: SW_RST_ALL (Bitfield-Mask: 0x01)            */
#define SDMMC_SW_RESET_SW_RST_CMD_LINE_Pos    (1UL)                     /*!< SDMMC SW_RESET: SW_RST_CMD_LINE (Bit 1)                     */
#define SDMMC_SW_RESET_SW_RST_CMD_LINE_Msk    (0x2UL)                   /*!< SDMMC SW_RESET: SW_RST_CMD_LINE (Bitfield-Mask: 0x01)       */
#define SDMMC_SW_RESET_SW_RST_DAT_LINE_Pos    (2UL)                     /*!< SDMMC SW_RESET: SW_RST_DAT_LINE (Bit 2)                     */
#define SDMMC_SW_RESET_SW_RST_DAT_LINE_Msk    (0x4UL)                   /*!< SDMMC SW_RESET: SW_RST_DAT_LINE (Bitfield-Mask: 0x01)       */

/* ----------------------------  SDMMC_INT_STATUS_NORM  --------------------------- */
#define SDMMC_INT_STATUS_NORM_CMD_COMPLETE_Pos (0UL)                    /*!< SDMMC INT_STATUS_NORM: CMD_COMPLETE (Bit 0)                 */
#define SDMMC_INT_STATUS_NORM_CMD_COMPLETE_Msk (0x1UL)                  /*!< SDMMC INT_STATUS_NORM: CMD_COMPLETE (Bitfield-Mask: 0x01)   */
#define SDMMC_INT_STATUS_NORM_TX_COMPLETE_Pos (1UL)                     /*!< SDMMC INT_STATUS_NORM: TX_COMPLETE (Bit 1)                  */
#define SDMMC_INT_STATUS_NORM_TX_COMPLETE_Msk (0x2UL)                   /*!< SDMMC INT_STATUS_NORM: TX_COMPLETE (Bitfield-Mask: 0x01)    */
#define SDMMC_INT_STATUS_NORM_BLOCK_GAP_EVENT_Pos (2UL)                 /*!< SDMMC INT_STATUS_NORM: BLOCK_GAP_EVENT (Bit 2)              */
#define SDMMC_INT_STATUS_NORM_BLOCK_GAP_EVENT_Msk (0x4UL)               /*!< SDMMC INT_STATUS_NORM: BLOCK_GAP_EVENT (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_NORM_BUFF_WRITE_READY_Pos (4UL)                /*!< SDMMC INT_STATUS_NORM: BUFF_WRITE_READY (Bit 4)             */
#define SDMMC_INT_STATUS_NORM_BUFF_WRITE_READY_Msk (0x10UL)             /*!< SDMMC INT_STATUS_NORM: BUFF_WRITE_READY (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_NORM_BUFF_READ_READY_Pos (5UL)                 /*!< SDMMC INT_STATUS_NORM: BUFF_READ_READY (Bit 5)              */
#define SDMMC_INT_STATUS_NORM_BUFF_READ_READY_Msk (0x20UL)              /*!< SDMMC INT_STATUS_NORM: BUFF_READ_READY (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_NORM_CARD_INS_Pos    (6UL)                     /*!< SDMMC INT_STATUS_NORM: CARD_INS (Bit 6)                     */
#define SDMMC_INT_STATUS_NORM_CARD_INS_Msk    (0x40UL)                  /*!< SDMMC INT_STATUS_NORM: CARD_INS (Bitfield-Mask: 0x01)       */
#define SDMMC_INT_STATUS_NORM_CARD_REMOVAL_Pos (7UL)                    /*!< SDMMC INT_STATUS_NORM: CARD_REMOVAL (Bit 7)                 */
#define SDMMC_INT_STATUS_NORM_CARD_REMOVAL_Msk (0x80UL)                 /*!< SDMMC INT_STATUS_NORM: CARD_REMOVAL (Bitfield-Mask: 0x01)   */
#define SDMMC_INT_STATUS_NORM_CARD_INT_Pos    (8UL)                     /*!< SDMMC INT_STATUS_NORM: CARD_INT (Bit 8)                     */
#define SDMMC_INT_STATUS_NORM_CARD_INT_Msk    (0x100UL)                 /*!< SDMMC INT_STATUS_NORM: CARD_INT (Bitfield-Mask: 0x01)       */
#define SDMMC_INT_STATUS_NORM_ERR_INT_Pos     (15UL)                    /*!< SDMMC INT_STATUS_NORM: ERR_INT (Bit 15)                     */
#define SDMMC_INT_STATUS_NORM_ERR_INT_Msk     (0x8000UL)                /*!< SDMMC INT_STATUS_NORM: ERR_INT (Bitfield-Mask: 0x01)        */

/* ----------------------------  SDMMC_INT_STATUS_ERR  ---------------------------- */
#define SDMMC_INT_STATUS_ERR_CMD_TIMEOUT_ERR_Pos (0UL)                  /*!< SDMMC INT_STATUS_ERR: CMD_TIMEOUT_ERR (Bit 0)               */
#define SDMMC_INT_STATUS_ERR_CMD_TIMEOUT_ERR_Msk (0x1UL)                /*!< SDMMC INT_STATUS_ERR: CMD_TIMEOUT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_ERR_CMD_CRC_ERR_Pos  (1UL)                     /*!< SDMMC INT_STATUS_ERR: CMD_CRC_ERR (Bit 1)                   */
#define SDMMC_INT_STATUS_ERR_CMD_CRC_ERR_Msk  (0x2UL)                   /*!< SDMMC INT_STATUS_ERR: CMD_CRC_ERR (Bitfield-Mask: 0x01)     */
#define SDMMC_INT_STATUS_ERR_CMD_END_BIT_ERR_Pos (2UL)                  /*!< SDMMC INT_STATUS_ERR: CMD_END_BIT_ERR (Bit 2)               */
#define SDMMC_INT_STATUS_ERR_CMD_END_BIT_ERR_Msk (0x4UL)                /*!< SDMMC INT_STATUS_ERR: CMD_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_ERR_CMD_IND_ERR_Pos  (3UL)                     /*!< SDMMC INT_STATUS_ERR: CMD_IND_ERR (Bit 3)                   */
#define SDMMC_INT_STATUS_ERR_CMD_IND_ERR_Msk  (0x8UL)                   /*!< SDMMC INT_STATUS_ERR: CMD_IND_ERR (Bitfield-Mask: 0x01)     */
#define SDMMC_INT_STATUS_ERR_DATA_TIMEOUT_ERR_Pos (4UL)                 /*!< SDMMC INT_STATUS_ERR: DATA_TIMEOUT_ERR (Bit 4)              */
#define SDMMC_INT_STATUS_ERR_DATA_TIMEOUT_ERR_Msk (0x10UL)              /*!< SDMMC INT_STATUS_ERR: DATA_TIMEOUT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_ERR_DATA_CRC_ERR_Pos (5UL)                     /*!< SDMMC INT_STATUS_ERR: DATA_CRC_ERR (Bit 5)                  */
#define SDMMC_INT_STATUS_ERR_DATA_CRC_ERR_Msk (0x20UL)                  /*!< SDMMC INT_STATUS_ERR: DATA_CRC_ERR (Bitfield-Mask: 0x01)    */
#define SDMMC_INT_STATUS_ERR_DATA_END_BIT_ERR_Pos (6UL)                 /*!< SDMMC INT_STATUS_ERR: DATA_END_BIT_ERR (Bit 6)              */
#define SDMMC_INT_STATUS_ERR_DATA_END_BIT_ERR_Msk (0x40UL)              /*!< SDMMC INT_STATUS_ERR: DATA_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_ERR_CURRENT_LIMIT_ERR_Pos (7UL)                /*!< SDMMC INT_STATUS_ERR: CURRENT_LIMIT_ERR (Bit 7)             */
#define SDMMC_INT_STATUS_ERR_CURRENT_LIMIT_ERR_Msk (0x80UL)             /*!< SDMMC INT_STATUS_ERR: CURRENT_LIMIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_INT_STATUS_ERR_ACMD_ERR_Pos     (8UL)                     /*!< SDMMC INT_STATUS_ERR: ACMD_ERR (Bit 8)                      */
#define SDMMC_INT_STATUS_ERR_ACMD_ERR_Msk     (0x100UL)                 /*!< SDMMC INT_STATUS_ERR: ACMD_ERR (Bitfield-Mask: 0x01)        */
#define SDMMC_INT_STATUS_ERR_CEATA_ERR_Pos    (13UL)                    /*!< SDMMC INT_STATUS_ERR: CEATA_ERR (Bit 13)                    */
#define SDMMC_INT_STATUS_ERR_CEATA_ERR_Msk    (0x2000UL)                /*!< SDMMC INT_STATUS_ERR: CEATA_ERR (Bitfield-Mask: 0x01)       */

/* --------------------------  SDMMC_EN_INT_STATUS_NORM  -------------------------- */
#define SDMMC_EN_INT_STATUS_NORM_CMD_COMPLETE_EN_Pos (0UL)              /*!< SDMMC EN_INT_STATUS_NORM: CMD_COMPLETE_EN (Bit 0)           */
#define SDMMC_EN_INT_STATUS_NORM_CMD_COMPLETE_EN_Msk (0x1UL)            /*!< SDMMC EN_INT_STATUS_NORM: CMD_COMPLETE_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_TX_COMPLETE_EN_Pos (1UL)               /*!< SDMMC EN_INT_STATUS_NORM: TX_COMPLETE_EN (Bit 1)            */
#define SDMMC_EN_INT_STATUS_NORM_TX_COMPLETE_EN_Msk (0x2UL)             /*!< SDMMC EN_INT_STATUS_NORM: TX_COMPLETE_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_BLOCK_GAP_EVENT_EN_Pos (2UL)           /*!< SDMMC EN_INT_STATUS_NORM: BLOCK_GAP_EVENT_EN (Bit 2)        */
#define SDMMC_EN_INT_STATUS_NORM_BLOCK_GAP_EVENT_EN_Msk (0x4UL)         /*!< SDMMC EN_INT_STATUS_NORM: BLOCK_GAP_EVENT_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_WRITE_READY_EN_Pos (4UL)          /*!< SDMMC EN_INT_STATUS_NORM: BUFF_WRITE_READY_EN (Bit 4)       */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_WRITE_READY_EN_Msk (0x10UL)       /*!< SDMMC EN_INT_STATUS_NORM: BUFF_WRITE_READY_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_READ_READY_EN_Pos (5UL)           /*!< SDMMC EN_INT_STATUS_NORM: BUFF_READ_READY_EN (Bit 5)        */
#define SDMMC_EN_INT_STATUS_NORM_BUFF_READ_READY_EN_Msk (0x20UL)        /*!< SDMMC EN_INT_STATUS_NORM: BUFF_READ_READY_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INS_EN_Pos (6UL)                  /*!< SDMMC EN_INT_STATUS_NORM: CARD_INS_EN (Bit 6)               */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INS_EN_Msk (0x40UL)               /*!< SDMMC EN_INT_STATUS_NORM: CARD_INS_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_CARD_REMOVAL_EN_Pos (7UL)              /*!< SDMMC EN_INT_STATUS_NORM: CARD_REMOVAL_EN (Bit 7)           */
#define SDMMC_EN_INT_STATUS_NORM_CARD_REMOVAL_EN_Msk (0x80UL)           /*!< SDMMC EN_INT_STATUS_NORM: CARD_REMOVAL_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INT_EN_Pos (8UL)                  /*!< SDMMC EN_INT_STATUS_NORM: CARD_INT_EN (Bit 8)               */
#define SDMMC_EN_INT_STATUS_NORM_CARD_INT_EN_Msk (0x100UL)              /*!< SDMMC EN_INT_STATUS_NORM: CARD_INT_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_NORM_FIXED_TO_0_Pos (15UL)                  /*!< SDMMC EN_INT_STATUS_NORM: FIXED_TO_0 (Bit 15)               */
#define SDMMC_EN_INT_STATUS_NORM_FIXED_TO_0_Msk (0x8000UL)              /*!< SDMMC EN_INT_STATUS_NORM: FIXED_TO_0 (Bitfield-Mask: 0x01)  */

/* ---------------------------  SDMMC_EN_INT_STATUS_ERR  -------------------------- */
#define SDMMC_EN_INT_STATUS_ERR_CMD_TIMEOUT_ERR_EN_Pos (0UL)            /*!< SDMMC EN_INT_STATUS_ERR: CMD_TIMEOUT_ERR_EN (Bit 0)         */
#define SDMMC_EN_INT_STATUS_ERR_CMD_TIMEOUT_ERR_EN_Msk (0x1UL)          /*!< SDMMC EN_INT_STATUS_ERR: CMD_TIMEOUT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_CMD_CRC_ERR_EN_Pos (1UL)                /*!< SDMMC EN_INT_STATUS_ERR: CMD_CRC_ERR_EN (Bit 1)             */
#define SDMMC_EN_INT_STATUS_ERR_CMD_CRC_ERR_EN_Msk (0x2UL)              /*!< SDMMC EN_INT_STATUS_ERR: CMD_CRC_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_CMD_END_BIT_ERR_EN_Pos (2UL)            /*!< SDMMC EN_INT_STATUS_ERR: CMD_END_BIT_ERR_EN (Bit 2)         */
#define SDMMC_EN_INT_STATUS_ERR_CMD_END_BIT_ERR_EN_Msk (0x4UL)          /*!< SDMMC EN_INT_STATUS_ERR: CMD_END_BIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_CMD_IND_ERR_EN_Pos (3UL)                /*!< SDMMC EN_INT_STATUS_ERR: CMD_IND_ERR_EN (Bit 3)             */
#define SDMMC_EN_INT_STATUS_ERR_CMD_IND_ERR_EN_Msk (0x8UL)              /*!< SDMMC EN_INT_STATUS_ERR: CMD_IND_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_DATA_TIMEOUT_ERR_EN_Pos (4UL)           /*!< SDMMC EN_INT_STATUS_ERR: DATA_TIMEOUT_ERR_EN (Bit 4)        */
#define SDMMC_EN_INT_STATUS_ERR_DATA_TIMEOUT_ERR_EN_Msk (0x10UL)        /*!< SDMMC EN_INT_STATUS_ERR: DATA_TIMEOUT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_DATA_CRC_ERR_EN_Pos (5UL)               /*!< SDMMC EN_INT_STATUS_ERR: DATA_CRC_ERR_EN (Bit 5)            */
#define SDMMC_EN_INT_STATUS_ERR_DATA_CRC_ERR_EN_Msk (0x20UL)            /*!< SDMMC EN_INT_STATUS_ERR: DATA_CRC_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_DATA_END_BIT_ERR_EN_Pos (6UL)           /*!< SDMMC EN_INT_STATUS_ERR: DATA_END_BIT_ERR_EN (Bit 6)        */
#define SDMMC_EN_INT_STATUS_ERR_DATA_END_BIT_ERR_EN_Msk (0x40UL)        /*!< SDMMC EN_INT_STATUS_ERR: DATA_END_BIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_CURRENT_LIMIT_ERR_EN_Pos (7UL)          /*!< SDMMC EN_INT_STATUS_ERR: CURRENT_LIMIT_ERR_EN (Bit 7)       */
#define SDMMC_EN_INT_STATUS_ERR_CURRENT_LIMIT_ERR_EN_Msk (0x80UL)       /*!< SDMMC EN_INT_STATUS_ERR: CURRENT_LIMIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_ACMD_ERR_EN_Pos (8UL)                   /*!< SDMMC EN_INT_STATUS_ERR: ACMD_ERR_EN (Bit 8)                */
#define SDMMC_EN_INT_STATUS_ERR_ACMD_ERR_EN_Msk (0x100UL)               /*!< SDMMC EN_INT_STATUS_ERR: ACMD_ERR_EN (Bitfield-Mask: 0x01)  */
#define SDMMC_EN_INT_STATUS_ERR_TARGET_RESP_ERR_EN_Pos (12UL)           /*!< SDMMC EN_INT_STATUS_ERR: TARGET_RESP_ERR_EN (Bit 12)        */
#define SDMMC_EN_INT_STATUS_ERR_TARGET_RESP_ERR_EN_Msk (0x1000UL)       /*!< SDMMC EN_INT_STATUS_ERR: TARGET_RESP_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_STATUS_ERR_CEATA_ERR_EN_Pos (13UL)                 /*!< SDMMC EN_INT_STATUS_ERR: CEATA_ERR_EN (Bit 13)              */
#define SDMMC_EN_INT_STATUS_ERR_CEATA_ERR_EN_Msk (0x2000UL)             /*!< SDMMC EN_INT_STATUS_ERR: CEATA_ERR_EN (Bitfield-Mask: 0x01) */

/* --------------------------  SDMMC_EN_INT_SIGNAL_NORM  -------------------------- */
#define SDMMC_EN_INT_SIGNAL_NORM_CMD_COMPLETE_EN_Pos (0UL)              /*!< SDMMC EN_INT_SIGNAL_NORM: CMD_COMPLETE_EN (Bit 0)           */
#define SDMMC_EN_INT_SIGNAL_NORM_CMD_COMPLETE_EN_Msk (0x1UL)            /*!< SDMMC EN_INT_SIGNAL_NORM: CMD_COMPLETE_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_TX_COMPLETE_EN_Pos (1UL)               /*!< SDMMC EN_INT_SIGNAL_NORM: TX_COMPLETE_EN (Bit 1)            */
#define SDMMC_EN_INT_SIGNAL_NORM_TX_COMPLETE_EN_Msk (0x2UL)             /*!< SDMMC EN_INT_SIGNAL_NORM: TX_COMPLETE_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_BLOCK_GAP_EVENT_EN_Pos (2UL)           /*!< SDMMC EN_INT_SIGNAL_NORM: BLOCK_GAP_EVENT_EN (Bit 2)        */
#define SDMMC_EN_INT_SIGNAL_NORM_BLOCK_GAP_EVENT_EN_Msk (0x4UL)         /*!< SDMMC EN_INT_SIGNAL_NORM: BLOCK_GAP_EVENT_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_WRITE_READY_EN_Pos (4UL)          /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_WRITE_READY_EN (Bit 4)       */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_WRITE_READY_EN_Msk (0x10UL)       /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_WRITE_READY_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_READ_READY_EN_Pos (5UL)           /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_READ_READY_EN (Bit 5)        */
#define SDMMC_EN_INT_SIGNAL_NORM_BUFF_READ_READY_EN_Msk (0x20UL)        /*!< SDMMC EN_INT_SIGNAL_NORM: BUFF_READ_READY_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INS_EN_Pos (6UL)                  /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INS_EN (Bit 6)               */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INS_EN_Msk (0x40UL)               /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INS_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_REMOVAL_EN_Pos (7UL)              /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_REMOVAL_EN (Bit 7)           */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_REMOVAL_EN_Msk (0x80UL)           /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_REMOVAL_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INT_EN_Pos (8UL)                  /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INT_EN (Bit 8)               */
#define SDMMC_EN_INT_SIGNAL_NORM_CARD_INT_EN_Msk (0x100UL)              /*!< SDMMC EN_INT_SIGNAL_NORM: CARD_INT_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_NORM_FIXED_TO_0_Pos (15UL)                  /*!< SDMMC EN_INT_SIGNAL_NORM: FIXED_TO_0 (Bit 15)               */
#define SDMMC_EN_INT_SIGNAL_NORM_FIXED_TO_0_Msk (0x8000UL)              /*!< SDMMC EN_INT_SIGNAL_NORM: FIXED_TO_0 (Bitfield-Mask: 0x01)  */

/* ---------------------------  SDMMC_EN_INT_SIGNAL_ERR  -------------------------- */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_TIMEOUT_ERR_EN_Pos (0UL)            /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_TIMEOUT_ERR_EN (Bit 0)         */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_TIMEOUT_ERR_EN_Msk (0x1UL)          /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_TIMEOUT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_CRC_ERR_EN_Pos (1UL)                /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_CRC_ERR_EN (Bit 1)             */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_CRC_ERR_EN_Msk (0x2UL)              /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_CRC_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_END_BIT_ERR_EN_Pos (2UL)            /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_END_BIT_ERR_EN (Bit 2)         */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_END_BIT_ERR_EN_Msk (0x4UL)          /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_END_BIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_IND_ERR_EN_Pos (3UL)                /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_IND_ERR_EN (Bit 3)             */
#define SDMMC_EN_INT_SIGNAL_ERR_CMD_IND_ERR_EN_Msk (0x8UL)              /*!< SDMMC EN_INT_SIGNAL_ERR: CMD_IND_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_TIMEOUT_ERR_EN_Pos (4UL)           /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_TIMEOUT_ERR_EN (Bit 4)        */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_TIMEOUT_ERR_EN_Msk (0x10UL)        /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_TIMEOUT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_CRC_ERR_EN_Pos (5UL)               /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_CRC_ERR_EN (Bit 5)            */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_CRC_ERR_EN_Msk (0x20UL)            /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_CRC_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_END_BIT_ERR_EN_Pos (6UL)           /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_END_BIT_ERR_EN (Bit 6)        */
#define SDMMC_EN_INT_SIGNAL_ERR_DATA_END_BIT_ERR_EN_Msk (0x40UL)        /*!< SDMMC EN_INT_SIGNAL_ERR: DATA_END_BIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_CURRENT_LIMIT_ERR_EN_Pos (7UL)          /*!< SDMMC EN_INT_SIGNAL_ERR: CURRENT_LIMIT_ERR_EN (Bit 7)       */
#define SDMMC_EN_INT_SIGNAL_ERR_CURRENT_LIMIT_ERR_EN_Msk (0x80UL)       /*!< SDMMC EN_INT_SIGNAL_ERR: CURRENT_LIMIT_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_ACMD_ERR_EN_Pos (8UL)                   /*!< SDMMC EN_INT_SIGNAL_ERR: ACMD_ERR_EN (Bit 8)                */
#define SDMMC_EN_INT_SIGNAL_ERR_ACMD_ERR_EN_Msk (0x100UL)               /*!< SDMMC EN_INT_SIGNAL_ERR: ACMD_ERR_EN (Bitfield-Mask: 0x01)  */
#define SDMMC_EN_INT_SIGNAL_ERR_TARGET_RESP_ERR_EN_Pos (12UL)           /*!< SDMMC EN_INT_SIGNAL_ERR: TARGET_RESP_ERR_EN (Bit 12)        */
#define SDMMC_EN_INT_SIGNAL_ERR_TARGET_RESP_ERR_EN_Msk (0x1000UL)       /*!< SDMMC EN_INT_SIGNAL_ERR: TARGET_RESP_ERR_EN (Bitfield-Mask: 0x01) */
#define SDMMC_EN_INT_SIGNAL_ERR_CEATA_ERR_EN_Pos (13UL)                 /*!< SDMMC EN_INT_SIGNAL_ERR: CEATA_ERR_EN (Bit 13)              */
#define SDMMC_EN_INT_SIGNAL_ERR_CEATA_ERR_EN_Msk (0x2000UL)             /*!< SDMMC EN_INT_SIGNAL_ERR: CEATA_ERR_EN (Bitfield-Mask: 0x01) */

/* ----------------------------  SDMMC_ACMD_ERR_STATUS  --------------------------- */
#define SDMMC_ACMD_ERR_STATUS_ACMD12_NOT_EXEC_ERR_Pos (0UL)             /*!< SDMMC ACMD_ERR_STATUS: ACMD12_NOT_EXEC_ERR (Bit 0)          */
#define SDMMC_ACMD_ERR_STATUS_ACMD12_NOT_EXEC_ERR_Msk (0x1UL)           /*!< SDMMC ACMD_ERR_STATUS: ACMD12_NOT_EXEC_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_ACMD_ERR_STATUS_ACMD_TIMEOUT_ERR_Pos (1UL)                /*!< SDMMC ACMD_ERR_STATUS: ACMD_TIMEOUT_ERR (Bit 1)             */
#define SDMMC_ACMD_ERR_STATUS_ACMD_TIMEOUT_ERR_Msk (0x2UL)              /*!< SDMMC ACMD_ERR_STATUS: ACMD_TIMEOUT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_ACMD_ERR_STATUS_ACMD_CRC_ERR_Pos (2UL)                    /*!< SDMMC ACMD_ERR_STATUS: ACMD_CRC_ERR (Bit 2)                 */
#define SDMMC_ACMD_ERR_STATUS_ACMD_CRC_ERR_Msk (0x4UL)                  /*!< SDMMC ACMD_ERR_STATUS: ACMD_CRC_ERR (Bitfield-Mask: 0x01)   */
#define SDMMC_ACMD_ERR_STATUS_ACMD_END_BIT_ERR_Pos (3UL)                /*!< SDMMC ACMD_ERR_STATUS: ACMD_END_BIT_ERR (Bit 3)             */
#define SDMMC_ACMD_ERR_STATUS_ACMD_END_BIT_ERR_Msk (0x8UL)              /*!< SDMMC ACMD_ERR_STATUS: ACMD_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_ACMD_ERR_STATUS_ACMD_IND_ERR_Pos (4UL)                    /*!< SDMMC ACMD_ERR_STATUS: ACMD_IND_ERR (Bit 4)                 */
#define SDMMC_ACMD_ERR_STATUS_ACMD_IND_ERR_Msk (0x10UL)                 /*!< SDMMC ACMD_ERR_STATUS: ACMD_IND_ERR (Bitfield-Mask: 0x01)   */
#define SDMMC_ACMD_ERR_STATUS_CMD_NOT_ISSUED_BY_ACMD12_ERR_Pos (7UL)    /*!< SDMMC ACMD_ERR_STATUS: CMD_NOT_ISSUED_BY_ACMD12_ERR (Bit 7) */
#define SDMMC_ACMD_ERR_STATUS_CMD_NOT_ISSUED_BY_ACMD12_ERR_Msk (0x80UL) /*!< SDMMC ACMD_ERR_STATUS: CMD_NOT_ISSUED_BY_ACMD12_ERR (Bitfield-Mask: 0x01) */

