MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4504-F100F512/mcu.h
/* --------------------  ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER  -------------------- */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_Pos (0UL)             /*!< ETH RECEIVE_INTERRUPT_WATCHDOG_TIMER: RIWT (Bit 0)          */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_Msk (0xffUL)          /*!< ETH RECEIVE_INTERRUPT_WATCHDOG_TIMER: RIWT (Bitfield-Mask: 0xff) */

/* -------------------------------  ETH_AHB_STATUS  ------------------------------- */
#define ETH_AHB_STATUS_AHBMS_Pos              (0UL)                     /*!< ETH AHB_STATUS: AHBMS (Bit 0)                               */
#define ETH_AHB_STATUS_AHBMS_Msk              (0x1UL)                   /*!< ETH AHB_STATUS: AHBMS (Bitfield-Mask: 0x01)                 */

/* --------------------  ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR  -------------------- */
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_Pos (0UL)      /*!< ETH CURRENT_HOST_TRANSMIT_DESCRIPTOR: CURTDESAPTR (Bit 0)   */
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_TRANSMIT_DESCRIPTOR: CURTDESAPTR (Bitfield-Mask: 0xffffffff) */

/* ---------------------  ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR  -------------------- */
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_Pos (0UL)       /*!< ETH CURRENT_HOST_RECEIVE_DESCRIPTOR: CURRDESAPTR (Bit 0)    */
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_RECEIVE_DESCRIPTOR: CURRDESAPTR (Bitfield-Mask: 0xffffffff) */

/* ------------------  ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS  ------------------ */
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_Pos (0UL)  /*!< ETH CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS: CURTBUFAPTR (Bit 0) */
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS: CURTBUFAPTR (Bitfield-Mask: 0xffffffff) */

/* -------------------  ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS  ------------------ */
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_Pos (0UL)   /*!< ETH CURRENT_HOST_RECEIVE_BUFFER_ADDRESS: CURRBUFAPTR (Bit 0) */
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_RECEIVE_BUFFER_ADDRESS: CURRBUFAPTR (Bitfield-Mask: 0xffffffff) */

/* -------------------------------  ETH_HW_FEATURE  ------------------------------- */
#define ETH_HW_FEATURE_MIISEL_Pos             (0UL)                     /*!< ETH HW_FEATURE: MIISEL (Bit 0)                              */
#define ETH_HW_FEATURE_MIISEL_Msk             (0x1UL)                   /*!< ETH HW_FEATURE: MIISEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_GMIISEL_Pos            (1UL)                     /*!< ETH HW_FEATURE: GMIISEL (Bit 1)                             */
#define ETH_HW_FEATURE_GMIISEL_Msk            (0x2UL)                   /*!< ETH HW_FEATURE: GMIISEL (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_HDSEL_Pos              (2UL)                     /*!< ETH HW_FEATURE: HDSEL (Bit 2)                               */
#define ETH_HW_FEATURE_HDSEL_Msk              (0x4UL)                   /*!< ETH HW_FEATURE: HDSEL (Bitfield-Mask: 0x01)                 */
#define ETH_HW_FEATURE_EXTHASHEN_Pos          (3UL)                     /*!< ETH HW_FEATURE: EXTHASHEN (Bit 3)                           */
#define ETH_HW_FEATURE_EXTHASHEN_Msk          (0x8UL)                   /*!< ETH HW_FEATURE: EXTHASHEN (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_HASHSEL_Pos            (4UL)                     /*!< ETH HW_FEATURE: HASHSEL (Bit 4)                             */
#define ETH_HW_FEATURE_HASHSEL_Msk            (0x10UL)                  /*!< ETH HW_FEATURE: HASHSEL (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_ADDMACADRSEL_Pos       (5UL)                     /*!< ETH HW_FEATURE: ADDMACADRSEL (Bit 5)                        */
#define ETH_HW_FEATURE_ADDMACADRSEL_Msk       (0x20UL)                  /*!< ETH HW_FEATURE: ADDMACADRSEL (Bitfield-Mask: 0x01)          */
#define ETH_HW_FEATURE_PCSSEL_Pos             (6UL)                     /*!< ETH HW_FEATURE: PCSSEL (Bit 6)                              */
#define ETH_HW_FEATURE_PCSSEL_Msk             (0x40UL)                  /*!< ETH HW_FEATURE: PCSSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_L3L4FLTREN_Pos         (7UL)                     /*!< ETH HW_FEATURE: L3L4FLTREN (Bit 7)                          */
#define ETH_HW_FEATURE_L3L4FLTREN_Msk         (0x80UL)                  /*!< ETH HW_FEATURE: L3L4FLTREN (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_SMASEL_Pos             (8UL)                     /*!< ETH HW_FEATURE: SMASEL (Bit 8)                              */
#define ETH_HW_FEATURE_SMASEL_Msk             (0x100UL)                 /*!< ETH HW_FEATURE: SMASEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_RWKSEL_Pos             (9UL)                     /*!< ETH HW_FEATURE: RWKSEL (Bit 9)                              */
#define ETH_HW_FEATURE_RWKSEL_Msk             (0x200UL)                 /*!< ETH HW_FEATURE: RWKSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_MGKSEL_Pos             (10UL)                    /*!< ETH HW_FEATURE: MGKSEL (Bit 10)                             */
#define ETH_HW_FEATURE_MGKSEL_Msk             (0x400UL)                 /*!< ETH HW_FEATURE: MGKSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_MMCSEL_Pos             (11UL)                    /*!< ETH HW_FEATURE: MMCSEL (Bit 11)                             */
#define ETH_HW_FEATURE_MMCSEL_Msk             (0x800UL)                 /*!< ETH HW_FEATURE: MMCSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_TSVER1SEL_Pos          (12UL)                    /*!< ETH HW_FEATURE: TSVER1SEL (Bit 12)                          */
#define ETH_HW_FEATURE_TSVER1SEL_Msk          (0x1000UL)                /*!< ETH HW_FEATURE: TSVER1SEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_TSVER2SEL_Pos          (13UL)                    /*!< ETH HW_FEATURE: TSVER2SEL (Bit 13)                          */
#define ETH_HW_FEATURE_TSVER2SEL_Msk          (0x2000UL)                /*!< ETH HW_FEATURE: TSVER2SEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_EEESEL_Pos             (14UL)                    /*!< ETH HW_FEATURE: EEESEL (Bit 14)                             */
#define ETH_HW_FEATURE_EEESEL_Msk             (0x4000UL)                /*!< ETH HW_FEATURE: EEESEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_AVSEL_Pos              (15UL)                    /*!< ETH HW_FEATURE: AVSEL (Bit 15)                              */
#define ETH_HW_FEATURE_AVSEL_Msk              (0x8000UL)                /*!< ETH HW_FEATURE: AVSEL (Bitfield-Mask: 0x01)                 */
#define ETH_HW_FEATURE_TXCOESEL_Pos           (16UL)                    /*!< ETH HW_FEATURE: TXCOESEL (Bit 16)                           */
#define ETH_HW_FEATURE_TXCOESEL_Msk           (0x10000UL)               /*!< ETH HW_FEATURE: TXCOESEL (Bitfield-Mask: 0x01)              */
#define ETH_HW_FEATURE_RXTYP1COE_Pos          (17UL)                    /*!< ETH HW_FEATURE: RXTYP1COE (Bit 17)                          */
#define ETH_HW_FEATURE_RXTYP1COE_Msk          (0x20000UL)               /*!< ETH HW_FEATURE: RXTYP1COE (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_RXTYP2COE_Pos          (18UL)                    /*!< ETH HW_FEATURE: RXTYP2COE (Bit 18)                          */
#define ETH_HW_FEATURE_RXTYP2COE_Msk          (0x40000UL)               /*!< ETH HW_FEATURE: RXTYP2COE (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_RXFIFOSIZE_Pos         (19UL)                    /*!< ETH HW_FEATURE: RXFIFOSIZE (Bit 19)                         */
#define ETH_HW_FEATURE_RXFIFOSIZE_Msk         (0x80000UL)               /*!< ETH HW_FEATURE: RXFIFOSIZE (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_RXCHCNT_Pos            (20UL)                    /*!< ETH HW_FEATURE: RXCHCNT (Bit 20)                            */
#define ETH_HW_FEATURE_RXCHCNT_Msk            (0x300000UL)              /*!< ETH HW_FEATURE: RXCHCNT (Bitfield-Mask: 0x03)               */
#define ETH_HW_FEATURE_TXCHCNT_Pos            (22UL)                    /*!< ETH HW_FEATURE: TXCHCNT (Bit 22)                            */
#define ETH_HW_FEATURE_TXCHCNT_Msk            (0xc00000UL)              /*!< ETH HW_FEATURE: TXCHCNT (Bitfield-Mask: 0x03)               */
#define ETH_HW_FEATURE_ENHDESSEL_Pos          (24UL)                    /*!< ETH HW_FEATURE: ENHDESSEL (Bit 24)                          */
#define ETH_HW_FEATURE_ENHDESSEL_Msk          (0x1000000UL)             /*!< ETH HW_FEATURE: ENHDESSEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_INTTSEN_Pos            (25UL)                    /*!< ETH HW_FEATURE: INTTSEN (Bit 25)                            */
#define ETH_HW_FEATURE_INTTSEN_Msk            (0x2000000UL)             /*!< ETH HW_FEATURE: INTTSEN (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_FLEXIPPSEN_Pos         (26UL)                    /*!< ETH HW_FEATURE: FLEXIPPSEN (Bit 26)                         */
#define ETH_HW_FEATURE_FLEXIPPSEN_Msk         (0x4000000UL)             /*!< ETH HW_FEATURE: FLEXIPPSEN (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_SAVLANINS_Pos          (27UL)                    /*!< ETH HW_FEATURE: SAVLANINS (Bit 27)                          */
#define ETH_HW_FEATURE_SAVLANINS_Msk          (0x8000000UL)             /*!< ETH HW_FEATURE: SAVLANINS (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_ACTPHYIF_Pos           (28UL)                    /*!< ETH HW_FEATURE: ACTPHYIF (Bit 28)                           */
#define ETH_HW_FEATURE_ACTPHYIF_Msk           (0x70000000UL)            /*!< ETH HW_FEATURE: ACTPHYIF (Bitfield-Mask: 0x07)              */


/* ================================================================================ */
/* ================           Group 'USB' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  USB_GOTGCTL  -------------------------------- */
#define USB_GOTGCTL_SesReqScs_Pos             (0UL)                     /*!< USB GOTGCTL: SesReqScs (Bit 0)                              */
#define USB_GOTGCTL_SesReqScs_Msk             (0x1UL)                   /*!< USB GOTGCTL: SesReqScs (Bitfield-Mask: 0x01)                */
#define USB_GOTGCTL_SesReq_Pos                (1UL)                     /*!< USB GOTGCTL: SesReq (Bit 1)                                 */
#define USB_GOTGCTL_SesReq_Msk                (0x2UL)                   /*!< USB GOTGCTL: SesReq (Bitfield-Mask: 0x01)                   */
#define USB_GOTGCTL_VbvalidOvEn_Pos           (2UL)                     /*!< USB GOTGCTL: VbvalidOvEn (Bit 2)                            */
#define USB_GOTGCTL_VbvalidOvEn_Msk           (0x4UL)                   /*!< USB GOTGCTL: VbvalidOvEn (Bitfield-Mask: 0x01)              */
#define USB_GOTGCTL_VbvalidOvVal_Pos          (3UL)                     /*!< USB GOTGCTL: VbvalidOvVal (Bit 3)                           */
#define USB_GOTGCTL_VbvalidOvVal_Msk          (0x8UL)                   /*!< USB GOTGCTL: VbvalidOvVal (Bitfield-Mask: 0x01)             */
#define USB_GOTGCTL_AvalidOvEn_Pos            (4UL)                     /*!< USB GOTGCTL: AvalidOvEn (Bit 4)                             */
#define USB_GOTGCTL_AvalidOvEn_Msk            (0x10UL)                  /*!< USB GOTGCTL: AvalidOvEn (Bitfield-Mask: 0x01)               */
#define USB_GOTGCTL_AvalidOvVal_Pos           (5UL)                     /*!< USB GOTGCTL: AvalidOvVal (Bit 5)                            */
#define USB_GOTGCTL_AvalidOvVal_Msk           (0x20UL)                  /*!< USB GOTGCTL: AvalidOvVal (Bitfield-Mask: 0x01)              */
#define USB_GOTGCTL_BvalidOvEn_Pos            (6UL)                     /*!< USB GOTGCTL: BvalidOvEn (Bit 6)                             */
#define USB_GOTGCTL_BvalidOvEn_Msk            (0x40UL)                  /*!< USB GOTGCTL: BvalidOvEn (Bitfield-Mask: 0x01)               */
#define USB_GOTGCTL_BvalidOvVal_Pos           (7UL)                     /*!< USB GOTGCTL: BvalidOvVal (Bit 7)                            */
#define USB_GOTGCTL_BvalidOvVal_Msk           (0x80UL)                  /*!< USB GOTGCTL: BvalidOvVal (Bitfield-Mask: 0x01)              */
#define USB_GOTGCTL_HstNegScs_Pos             (8UL)                     /*!< USB GOTGCTL: HstNegScs (Bit 8)                              */
#define USB_GOTGCTL_HstNegScs_Msk             (0x100UL)                 /*!< USB GOTGCTL: HstNegScs (Bitfield-Mask: 0x01)                */
#define USB_GOTGCTL_HNPReq_Pos                (9UL)                     /*!< USB GOTGCTL: HNPReq (Bit 9)                                 */
#define USB_GOTGCTL_HNPReq_Msk                (0x200UL)                 /*!< USB GOTGCTL: HNPReq (Bitfield-Mask: 0x01)                   */
#define USB_GOTGCTL_HstSetHNPEn_Pos           (10UL)                    /*!< USB GOTGCTL: HstSetHNPEn (Bit 10)                           */
#define USB_GOTGCTL_HstSetHNPEn_Msk           (0x400UL)                 /*!< USB GOTGCTL: HstSetHNPEn (Bitfield-Mask: 0x01)              */
#define USB_GOTGCTL_DevHNPEn_Pos              (11UL)                    /*!< USB GOTGCTL: DevHNPEn (Bit 11)                              */
#define USB_GOTGCTL_DevHNPEn_Msk              (0x800UL)                 /*!< USB GOTGCTL: DevHNPEn (Bitfield-Mask: 0x01)                 */
#define USB_GOTGCTL_ConlDSts_Pos              (16UL)                    /*!< USB GOTGCTL: ConlDSts (Bit 16)                              */
#define USB_GOTGCTL_ConlDSts_Msk              (0x10000UL)               /*!< USB GOTGCTL: ConlDSts (Bitfield-Mask: 0x01)                 */
#define USB_GOTGCTL_DbncTime_Pos              (17UL)                    /*!< USB GOTGCTL: DbncTime (Bit 17)                              */
#define USB_GOTGCTL_DbncTime_Msk              (0x20000UL)               /*!< USB GOTGCTL: DbncTime (Bitfield-Mask: 0x01)                 */
#define USB_GOTGCTL_ASesVId_Pos               (18UL)                    /*!< USB GOTGCTL: ASesVId (Bit 18)                               */
#define USB_GOTGCTL_ASesVId_Msk               (0x40000UL)               /*!< USB GOTGCTL: ASesVId (Bitfield-Mask: 0x01)                  */
#define USB_GOTGCTL_BSesVld_Pos               (19UL)                    /*!< USB GOTGCTL: BSesVld (Bit 19)                               */
#define USB_GOTGCTL_BSesVld_Msk               (0x80000UL)               /*!< USB GOTGCTL: BSesVld (Bitfield-Mask: 0x01)                  */
#define USB_GOTGCTL_OTGVer_Pos                (20UL)                    /*!< USB GOTGCTL: OTGVer (Bit 20)                                */
#define USB_GOTGCTL_OTGVer_Msk                (0x100000UL)              /*!< USB GOTGCTL: OTGVer (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  USB_GOTGINT  -------------------------------- */
#define USB_GOTGINT_SesEndDet_Pos             (2UL)                     /*!< USB GOTGINT: SesEndDet (Bit 2)                              */
#define USB_GOTGINT_SesEndDet_Msk             (0x4UL)                   /*!< USB GOTGINT: SesEndDet (Bitfield-Mask: 0x01)                */
#define USB_GOTGINT_SesReqSucStsChng_Pos      (8UL)                     /*!< USB GOTGINT: SesReqSucStsChng (Bit 8)                       */
#define USB_GOTGINT_SesReqSucStsChng_Msk      (0x100UL)                 /*!< USB GOTGINT: SesReqSucStsChng (Bitfield-Mask: 0x01)         */
#define USB_GOTGINT_HstNegSucStsChng_Pos      (9UL)                     /*!< USB GOTGINT: HstNegSucStsChng (Bit 9)                       */
#define USB_GOTGINT_HstNegSucStsChng_Msk      (0x200UL)                 /*!< USB GOTGINT: HstNegSucStsChng (Bitfield-Mask: 0x01)         */
#define USB_GOTGINT_HstNegDet_Pos             (17UL)                    /*!< USB GOTGINT: HstNegDet (Bit 17)                             */
#define USB_GOTGINT_HstNegDet_Msk             (0x20000UL)               /*!< USB GOTGINT: HstNegDet (Bitfield-Mask: 0x01)                */
#define USB_GOTGINT_ADevTOUTChg_Pos           (18UL)                    /*!< USB GOTGINT: ADevTOUTChg (Bit 18)                           */
#define USB_GOTGINT_ADevTOUTChg_Msk           (0x40000UL)               /*!< USB GOTGINT: ADevTOUTChg (Bitfield-Mask: 0x01)              */
#define USB_GOTGINT_DbnceDone_Pos             (19UL)                    /*!< USB GOTGINT: DbnceDone (Bit 19)                             */
#define USB_GOTGINT_DbnceDone_Msk             (0x80000UL)               /*!< USB GOTGINT: DbnceDone (Bitfield-Mask: 0x01)                */

/* ---------------------------------  USB_GAHBCFG  -------------------------------- */
#define USB_GAHBCFG_GlblIntrMsk_Pos           (0UL)                     /*!< USB GAHBCFG: GlblIntrMsk (Bit 0)                            */
#define USB_GAHBCFG_GlblIntrMsk_Msk           (0x1UL)                   /*!< USB GAHBCFG: GlblIntrMsk (Bitfield-Mask: 0x01)              */
#define USB_GAHBCFG_HBstLen_Pos               (1UL)                     /*!< USB GAHBCFG: HBstLen (Bit 1)                                */
#define USB_GAHBCFG_HBstLen_Msk               (0x1eUL)                  /*!< USB GAHBCFG: HBstLen (Bitfield-Mask: 0x0f)                  */
#define USB_GAHBCFG_DMAEn_Pos                 (5UL)                     /*!< USB GAHBCFG: DMAEn (Bit 5)                                  */
#define USB_GAHBCFG_DMAEn_Msk                 (0x20UL)                  /*!< USB GAHBCFG: DMAEn (Bitfield-Mask: 0x01)                    */
#define USB_GAHBCFG_NPTxFEmpLvl_Pos           (7UL)                     /*!< USB GAHBCFG: NPTxFEmpLvl (Bit 7)                            */
#define USB_GAHBCFG_NPTxFEmpLvl_Msk           (0x80UL)                  /*!< USB GAHBCFG: NPTxFEmpLvl (Bitfield-Mask: 0x01)              */
#define USB_GAHBCFG_PTxFEmpLvl_Pos            (8UL)                     /*!< USB GAHBCFG: PTxFEmpLvl (Bit 8)                             */
#define USB_GAHBCFG_PTxFEmpLvl_Msk            (0x100UL)                 /*!< USB GAHBCFG: PTxFEmpLvl (Bitfield-Mask: 0x01)               */

/* ---------------------------------  USB_GUSBCFG  -------------------------------- */
#define USB_GUSBCFG_TOutCal_Pos               (0UL)                     /*!< USB GUSBCFG: TOutCal (Bit 0)                                */
#define USB_GUSBCFG_TOutCal_Msk               (0x7UL)                   /*!< USB GUSBCFG: TOutCal (Bitfield-Mask: 0x07)                  */
#define USB_GUSBCFG_PHYSel_Pos                (6UL)                     /*!< USB GUSBCFG: PHYSel (Bit 6)                                 */
#define USB_GUSBCFG_PHYSel_Msk                (0x40UL)                  /*!< USB GUSBCFG: PHYSel (Bitfield-Mask: 0x01)                   */
#define USB_GUSBCFG_SRPCap_Pos                (8UL)                     /*!< USB GUSBCFG: SRPCap (Bit 8)                                 */
#define USB_GUSBCFG_SRPCap_Msk                (0x100UL)                 /*!< USB GUSBCFG: SRPCap (Bitfield-Mask: 0x01)                   */
#define USB_GUSBCFG_HNPCap_Pos                (9UL)                     /*!< USB GUSBCFG: HNPCap (Bit 9)                                 */
#define USB_GUSBCFG_HNPCap_Msk                (0x200UL)                 /*!< USB GUSBCFG: HNPCap (Bitfield-Mask: 0x01)                   */
#define USB_GUSBCFG_USBTrdTim_Pos             (10UL)                    /*!< USB GUSBCFG: USBTrdTim (Bit 10)                             */
#define USB_GUSBCFG_USBTrdTim_Msk             (0x3c00UL)                /*!< USB GUSBCFG: USBTrdTim (Bitfield-Mask: 0x0f)                */
#define USB_GUSBCFG_OtgI2CSel_Pos             (16UL)                    /*!< USB GUSBCFG: OtgI2CSel (Bit 16)                             */
#define USB_GUSBCFG_OtgI2CSel_Msk             (0x10000UL)               /*!< USB GUSBCFG: OtgI2CSel (Bitfield-Mask: 0x01)                */
#define USB_GUSBCFG_TxEndDelay_Pos            (28UL)                    /*!< USB GUSBCFG: TxEndDelay (Bit 28)                            */
#define USB_GUSBCFG_TxEndDelay_Msk            (0x10000000UL)            /*!< USB GUSBCFG: TxEndDelay (Bitfield-Mask: 0x01)               */
#define USB_GUSBCFG_ForceHstMode_Pos          (29UL)                    /*!< USB GUSBCFG: ForceHstMode (Bit 29)                          */
#define USB_GUSBCFG_ForceHstMode_Msk          (0x20000000UL)            /*!< USB GUSBCFG: ForceHstMode (Bitfield-Mask: 0x01)             */
#define USB_GUSBCFG_ForceDevMode_Pos          (30UL)                    /*!< USB GUSBCFG: ForceDevMode (Bit 30)                          */
#define USB_GUSBCFG_ForceDevMode_Msk          (0x40000000UL)            /*!< USB GUSBCFG: ForceDevMode (Bitfield-Mask: 0x01)             */
#define USB_GUSBCFG_CTP_Pos                   (31UL)                    /*!< USB GUSBCFG: CTP (Bit 31)                                   */
#define USB_GUSBCFG_CTP_Msk                   (0x80000000UL)            /*!< USB GUSBCFG: CTP (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  USB_GRSTCTL  -------------------------------- */
#define USB_GRSTCTL_CSftRst_Pos               (0UL)                     /*!< USB GRSTCTL: CSftRst (Bit 0)                                */
#define USB_GRSTCTL_CSftRst_Msk               (0x1UL)                   /*!< USB GRSTCTL: CSftRst (Bitfield-Mask: 0x01)                  */
#define USB_GRSTCTL_FrmCntrRst_Pos            (2UL)                     /*!< USB GRSTCTL: FrmCntrRst (Bit 2)                             */
#define USB_GRSTCTL_FrmCntrRst_Msk            (0x4UL)                   /*!< USB GRSTCTL: FrmCntrRst (Bitfield-Mask: 0x01)               */
#define USB_GRSTCTL_RxFFlsh_Pos               (4UL)                     /*!< USB GRSTCTL: RxFFlsh (Bit 4)                                */
#define USB_GRSTCTL_RxFFlsh_Msk               (0x10UL)                  /*!< USB GRSTCTL: RxFFlsh (Bitfield-Mask: 0x01)                  */
#define USB_GRSTCTL_TxFFlsh_Pos               (5UL)                     /*!< USB GRSTCTL: TxFFlsh (Bit 5)                                */
#define USB_GRSTCTL_TxFFlsh_Msk               (0x20UL)                  /*!< USB GRSTCTL: TxFFlsh (Bitfield-Mask: 0x01)                  */
#define USB_GRSTCTL_TxFNum_Pos                (6UL)                     /*!< USB GRSTCTL: TxFNum (Bit 6)                                 */
#define USB_GRSTCTL_TxFNum_Msk                (0x7c0UL)                 /*!< USB GRSTCTL: TxFNum (Bitfield-Mask: 0x1f)                   */
#define USB_GRSTCTL_DMAReq_Pos                (30UL)                    /*!< USB GRSTCTL: DMAReq (Bit 30)                                */
#define USB_GRSTCTL_DMAReq_Msk                (0x40000000UL)            /*!< USB GRSTCTL: DMAReq (Bitfield-Mask: 0x01)                   */
#define USB_GRSTCTL_AHBIdle_Pos               (31UL)                    /*!< USB GRSTCTL: AHBIdle (Bit 31)                               */
#define USB_GRSTCTL_AHBIdle_Msk               (0x80000000UL)            /*!< USB GRSTCTL: AHBIdle (Bitfield-Mask: 0x01)                  */

